Zapadenec1982/ModESP/test/integration_test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Main task stack size for integration tests
CONFIG_MAIN_TASK_STACK_SIZE=16384

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# Memory configuration
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_5=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y

# Debug configuration
CONFIG_ESP_DEBUG_OCDAWARE=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# WiFi for testing
CONFIG_ESP32_WIFI_ENABLED=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y 